var VALUES = Array();
							VALUES["Выручка, млрд руб."] = new Array(4);
							VALUES["Доля выручки Компанииот ВВП Российской Федерации, %"] = new Array(4);
							VALUES["Операционная прибыль, млрд руб"] = new Array(4);
              				VALUES["OIBDA, млрд руб."] = new Array(4);
              				VALUES["Количество развивающихся активов, выплативших дивиденды, шт"] = new Array(4);
              				VALUES["Процент дивидендов, полученных от развивающихся активов, от общей суммы дивидендов, %"] = new Array(4);
             				VALUES["Общие расходы и инвестиции компаниям Группы АФК «Система» на охрану окружающей среды, млрд руб."] = new Array(4);
              				VALUES["Объем инвестиционной программы компаний Группы АФК «Система», млрд руб."] = new Array(4);
              				VALUES["Объем налоговых отчислений в федеральный и региональные бюджеты, млрд руб."] = new Array(4);
                            VALUES["Расходы на благотворительность и социальные программы, млрд руб."] = new Array(4);
                            //VALUES["Средняя текучесть кадров по компаниям Группы АФК «Система», %"] = new Array(4);
                            VALUES["Число сотрудников, человек"] = new Array(4);
                            VALUES["Уровень вовлеченности персонала в добровольческую деятельность, %"] = new Array(4);

              				VALUES["Выручка, млрд руб."]["2013"] = 589.3;
							VALUES["Выручка, млрд руб."]["2014"] = 631.9;
							VALUES["Выручка, млрд руб."]["2015"] = 708.6;

              				VALUES["Доля выручки Компанииот ВВП Российской Федерации, %"]["2013"] = 0.8;
							VALUES["Доля выручки Компанииот ВВП Российской Федерации, %"]["2014"] = 0.83;
							VALUES["Доля выручки Компанииот ВВП Российской Федерации, %"]["2015"] = 0.88;

							VALUES["Операционная прибыль, млрд руб"]["2013"] = 113.6;
							VALUES["Операционная прибыль, млрд руб"]["2014"] = 60.9;
							VALUES["Операционная прибыль, млрд руб"]["2015"] = 69;

							VALUES["OIBDA, млрд руб."]["2013"] = 177.4;
							VALUES["OIBDA, млрд руб."]["2014"] = 165.2;
							VALUES["OIBDA, млрд руб."]["2015"] = 176.4;

							VALUES["Количество развивающихся активов, выплативших дивиденды, шт"]["2013"] = 0;
							VALUES["Количество развивающихся активов, выплативших дивиденды, шт"]["2014"] = 9;
							VALUES["Количество развивающихся активов, выплативших дивиденды, шт"]["2015"] = 9;

							VALUES["Процент дивидендов, полученных от развивающихся активов, от общей суммы дивидендов, %"]["2013"] = 3.7;
							VALUES["Процент дивидендов, полученных от развивающихся активов, от общей суммы дивидендов, %"]["2014"] = 6.9;
							VALUES["Процент дивидендов, полученных от развивающихся активов, от общей суммы дивидендов, %"]["2015"] = 17.8;

							VALUES["Общие расходы и инвестиции компаниям Группы АФК «Система» на охрану окружающей среды, млрд руб."]["2013"] = 1.3;
							VALUES["Общие расходы и инвестиции компаниям Группы АФК «Система» на охрану окружающей среды, млрд руб."]["2014"] = 1.4;
							VALUES["Общие расходы и инвестиции компаниям Группы АФК «Система» на охрану окружающей среды, млрд руб."]["2015"] = 1.6;

							VALUES["Объем инвестиционной программы компаний Группы АФК «Система», млрд руб."]["2013"] = 95.4;
							VALUES["Объем инвестиционной программы компаний Группы АФК «Система», млрд руб."]["2014"] = 115.8;
							VALUES["Объем инвестиционной программы компаний Группы АФК «Система», млрд руб."]["2015"] = 139.2;

							VALUES["Объем налоговых отчислений в федеральный и региональные бюджеты, млрд руб."]["2013"] = 93.1;
							VALUES["Объем налоговых отчислений в федеральный и региональные бюджеты, млрд руб."]["2014"] = 100;
							VALUES["Объем налоговых отчислений в федеральный и региональные бюджеты, млрд руб."]["2015"] = 88.2;


							VALUES["Расходы на благотворительность и социальные программы, млрд руб."]["2013"] = 1.8;
							VALUES["Расходы на благотворительность и социальные программы, млрд руб."]["2014"] = 0.9;
							VALUES["Расходы на благотворительность и социальные программы, млрд руб."]["2015"] = 1.35;

							/*VALUES["Средняя текучесть кадров по компаниям Группы АФК «Система», %"]["2013"] = 0;
							VALUES["Средняя текучесть кадров по компаниям Группы АФК «Система», %"]["2014"] = 23;
							VALUES["Средняя текучесть кадров по компаниям Группы АФК «Система», %"]["2015"] = 21;*/

							VALUES["Число сотрудников, человек"]["2013"] = 167544;
							VALUES["Число сотрудников, человек"]["2014"] = 155779
							VALUES["Число сотрудников, человек"]["2015"] = 155251;

							VALUES["Уровень вовлеченности персонала в добровольческую деятельность, %"]["2013"] = 0;
							VALUES["Уровень вовлеченности персонала в добровольческую деятельность, %"]["2014"] = 4.2;
							VALUES["Уровень вовлеченности персонала в добровольческую деятельность, %"]["2015"] = 6.7;


							//ПРИРОДНЫЙ КАПИТАЛ
/*
              				VALUES["Затраты на охрану окружающей среды, тыс. руб."] = new Array(4);

              				VALUES["Затраты на охрану окружающей среды, тыс. руб."]["2013"] = 7432;
							VALUES["Затраты на охрану окружающей среды, тыс. руб."]["2014"] = 6077;
							VALUES["Затраты на охрану окружающей среды, тыс. руб."]["2015"] = 10158;
*/

							$(function () {
								$('.option input').on('change', function(e){
									var $allOptions = $('.option input');
									var series = [];
									$allOptions.each(function(number, element){
										var $this = $(this);
										if($this.is(':checked')){
											var name = $this.attr('name');
											var tmpObj = {
												name: name,
												data: [VALUES[name]["2013"], VALUES[name]["2014"], VALUES[name]["2015"]],
												color:  VALUES[name]["color"]
											};
											series.push(tmpObj);
										}
									});
									options.series = series;

									options.chart.renderTo = 'chart';
							//        options.chart.type = chartType;
									var chart = new Highcharts.Chart(options);
								});
							});

							var chart;
							var options;
							var chartType = 'spline';
							$(function () {
                                console.log('tttt');
									options ={
									title: {
										text: 'Интерактивная аналитика'
									},
									legend: {
										layout: 'vertical',
										backgroundColor: (Highcharts.theme && Highcharts.theme.legendBackgroundColor) || '#FFFFFF'
									},
									series: [{
										name: 'Выручка, млрд руб.',
										data: [VALUES["Выручка, млрд руб."]["2013"], VALUES["Выручка, млрд руб."]["2014"], VALUES["Выручка, млрд руб."]["2015"]]
									}
									],
									chart: {
										type: chartType
									},
									title: {
										text: ''
									},
									yAxis: {
										allowDecimals: false,
										title : {
											text :''
										}
									},
									xAxis: {
										categories: [
											'2013',
											'2014',
											'2015'

										],
										title : {
											text :'Год'
										}
									}
								  }
								chart = $('#chart').highcharts(options);

								$('#column').on('click', function(e){
									e.preventDefault();
									options.chart.renderTo = 'chart';
									options.chart.type = 'column';
									chartType = 'column';
									var chart = new Highcharts.Chart(options);
									$(this).addClass('active_chart_type').siblings('a').removeClass('active_chart_type');
								});
								$('#spline').on('click', function(e){
									e.preventDefault();
									options.chart.renderTo = 'chart';
									options.chart.type = 'spline';
									chartType = 'spline';
									var chart = new Highcharts.Chart(options);
									$(this).addClass('active_chart_type').siblings('a').removeClass('active_chart_type');
								});
							});